# x = 26
# d = [0] * 30001

# for i in range(2, x+1):
#     d[i] = d[i-1] + 1
#     print("d["+str(i)+"] : ", d[i])
#     if i % 2 == 0:
#         print(str(i)+" : ", d[i], d[i//2]+1)
#         d[i] = min(d[i], d[i // 2] + 1)
        
#     if i % 3 == 0:
#         print(str(i)+" : ", d[i], d[i//3]+1)
#         d[i] = min(d[i], d[i // 3] + 1) 
        
#     if i % 5 == 0:
#         print(str(i)+" : ", d[i], d[i//5]+1)
#         d[i] = min(d[i], d[i // 5] + 1)
        
# print(d[x])

# -------------------------------------------------------------------------

# # 개미전사

# n = 4
# array = [1, 3, 1, 5]
# d = [0] * n

# d[0] = array[0]
# d[1] = max(array[0], array[1])

# for i in range(2, n):
#     d[i] = max(d[i-1], d[i-2] + array[i])

# print(d[n-1])

# -------------------------------------------------------------------------

# # 바닥 공사

# n = 3

# d = [0] * 1000

# d[1] = 1
# d[2] = 3

# for i in range(3, n+1):
#     d[i] = (d[i-1] + 2 * d[i-2]) % 796796

# print(d[n])


# -------------------------------------------------------------------------

# 효율적 화폐 구성
n = 2
m = 15
arr = [2, 3]

d = [10001] * 1000
d[0] = 0

for i in range(n): # 0
    for j in range(arr[i], m+1): # 4
        d[j] = min(d[j], d[j-arr[i]]+1)

print(d[m])
